{
    "ISFP":{
        "clubs":[
            "ISF", 
            "SFC"
        ],
        "type":"성인군자형",
        "explanation1":"ISFP는 다정하고 정서적이며 친절한 타입입니다.",
        "explanation2":"자신의 시간과 공간 안에서 활동하는 것을 좋아하며, 자신의 가치를 중요시 여기는 편입니다. 그렇게 때문에 의미있는 사람들에게 매우 충실하고 헌신하는 타입입니다. 또한 논쟁 및 갈등을 싫어하기 때문에 본인의 의견이나 가치를 타인에게 강요하지 않습니다."
    },
    "ISFJ":{
        "clubs":[
            "DFC",
            "호버링"
        ],
        "type":"권력형",
        "explanation1":"ISFJ는 대체로 온화하고 성실하며 사려깊은 성격을 가졌습니다.",
        "explanation2":"세심하고 협조를 잘 하며 책임감과 인내력 또한 강한 편에 속합니다. 언제나 가볍지 않고 진솔하려 노력하기 때문에 관계를 맺기에 믿음직스러운 유형입니다. 주변 사람이 안전하고 행복한 삶을 살 수 있도록 돕는 일에서 만족감을 느낍니다."
    },
    "ISTP":{
        "clubs":[
            "일어회화반",
            "전원회"
        ],
        "type":"백과사전형",
        "explanation1":"ISTP는 논리적이고 정확한 것을 중요시 여기는 편입니다.",
        "explanation2":"조용하고 과묵한 성격으로, 객관적으로 인생을 관찰하는 타입에 속합니다. 사실적 자료를 정리, 조직하기를 좋아하고 기계를 다루거나 인과 관계, 객관적 원리에 관심이 많습니다. 상황을 민첩하게 파악하는 능력이 있으며 정밀을 요하는 일을 잘 해냅니다."

    },
    "ISTJ":{
        "clubs":[
            "ARC",
            "!deas",
            "난파법학회"
        ],
        "type":"소금형",
        "explanation1":"ISTJ는 책임감이 강하고, 규칙을 엄수하며 논리적이고 객관적인 편에 속합니다.",
        "explanation2":"표준적인 방식에 따라 계획적으로 일하는 것을 선호하고 한 번 시작한 일을 끝까지 해내는 경향이 있으며 실제적이고 실용적인 분야에 관심을 갖습니다."  
    },
    "INFP":{
        "clubs":[
            "CTRL",
            "UBF",
            "Alchemy"
        ],
        "type":"잔다르크형",
        "explanation1":"INFP는 마음이 따뜻하고 자신이 관계하는 일이나 사람에 대하여 책임감이 강하고 성실한 편입니다.",
        "explanation2":"공감 능력이 높고 자신과 다른 것에 대해 관대하며 타인의 이야기를 잘 경청합니다. 사람들과 조화롭게 살고자 하며 분쟁을 피하기 위해 노력하고, 이상적인 세상을 만들어가려 합니다. 이들에게 삶의 목적이란 타인을 돕고 어려움에 공감하는 일과 관련이 있습니다."
    },
    "INFJ":{
        "clubs":[
            "당다라당",
            "한사랑",
            "열린만화창",
            "일본문화연구회",
            "ECHO",
            "F;ACT",
            "ENM",
            "마음쉬는곳",
            "미담장학회"
        ],
        "type":"예언자형",
        "explanation1":"INFJ는 진정성을 중시하고 개인주의, 이상주의적 성향이 강한 편입니다.",
        "explanation2":"타인의 감정을 세심하게 살피고 사람에 관한 뛰어난 통찰력을 가졌으며 누군가를 기쁘게 하는 일을 즐거워합니다. 또한 선과 악, 도덕적인 것과 비도덕적인 것에 대하여 민감하게 반응하는 편입니다." 
    },
    "INTP":{
        "clubs":[
            "관현악반",
            "ESU"
        ],
        "type":"아이디어형",
        "explanation1":"INTP는 비평적인 관점을 가진 뛰어난 전략가 타입입니다.",
        "explanation2":"조용하고 과묵하며 몽상을 즐기고, 관심있는 분야에 대해서는 열정적으로 반응합니다. 창의적 지능과 논리 면에서 뛰어나며 분석과 추리를 좋아합니다. 본인의 주관과 세계가 확고한 편으로 대중적인 관심사에는 관심이 없는 경우가 많습니다."
    },
    "INTJ":{
        "clubs":[
            "테크니션",
            "Sea-Fox"
        ],
        "type":"과학자형",
        "explanation1":"INTJ는 일관성 있는 것과 합리적인 것을 선호하는 편입니다.",
        "explanation2":"MBTI 유형 중 가장 희귀한 타입으로, 완벽주의 성향을 가지고 있으며 계획하고 설계하는 것을 좋아합니다. 목표가 설정되면 전념하는 경향이 있으며 자신의 관심사에 깊이 파고들고 지식을 계속해서 탐구하려 합니다."
        
    },
    "ESFP":{
        "clubs":[
            "ESF",
            "바이슨",
            "맥킨토쉬"
        ],
        "type":"사교형",
        "explanation1":"ESFP는 분위기를 고조시키는 우호적인 성격을 가진 타입입니다.",
        "explanation2":"MBTI 유형 중 외향적 성향이 가장 강하고, 긍정적이고 밝은 에너지 덕분에 분위기를 잘 이끄는 편입니다. 기본적으로 흥이 많으며 신나고 재미있는 성격을 가진 사람들이 많습니다. 사람들 앞에 서는 것을 좋아하고 주목받기를 즐기며 새로운 것을 시도하는 것에 두려움이 없는 모습을 보이기도 합니다."
    },
    "ESFJ":{
        "clubs":[
            "흥사단",
            "로타랙트",
            "어푸어푸",
            "두드림",
            "IVF",
            "그립",
            "COC",
            "랭스"
        ],
        "type":"친선도모형",
        "explanation1":"ESFJ는 친절, 현실감을 바탕으로 타인에게 봉사하는 타입입니다.",
        "explanation2":"기본적으로 예의바르고 친절하며 사교적인 성격으로 타인에게 관심이 많습니다. 동정심과 동료애가 많으며 인화를 도모하는 일을 중요하게 여깁니다. 일상적인 일에 잘 적응하며 조화와 균형을 추구합니다. 또한 원칙을 중요시하고 현실적이고 실제적입니다."
    },
    "ESTP":{
        "clubs":[
            "PPP"
        ],
        "type":"활동가형",
        "explanation1":"ESTP는 즉각적인 결과에 초점이 맞춰진 현실적인 접근을 선호합니다.",
        "explanation2":"상황에 유연하며 적응능력과 응용능력이 뛰어나고 선입견이 없는 편으로 다양한 것들을 수용합니다. 이들은 현재에 집중하며 타인들과 활기차게 할 수 있는 매 순간을 즐깁니다. 개방적이고 자유를 추구하며, 억압당하는 것은 좋아하지 않습니다. 또한 이들은 현실적이고 합리적인 효율을 중요시합니다."
    },
    "ESTJ":{
        "clubs":[
            "태백회",
            "블랙베어스",
            "전설"
        ],
        "type":"사업가형",
        "explanation1":"ESTJ는 사무적이고 실용적이며 현실적인 타입입니다.",
        "explanation2":"목표지향적인 성격으로 계획적으로 일을 완성하는 편이며 규칙을 중시합니다. 계획이 틀어지거나 불확실한 것을 피하고 좋아하는 것과 싫어하는 것을 명백하게 구분합니다. 책임감과 의지가 강해 리더의 자리를 맡는 경우가 많습니다."
    },
    "ENFP":{
        "clubs":[
            "별따오기",
            "얼라이브",
            "CAST",
            "ZOOM",
            "DOVE"
        ],
        "type":"스파크형",
        "explanation1":"ENFP는 창의적이며 항상 새로운 가능성을 찾고 시도하는 유형입니다.",
        "explanation2":"정열적이고 활기가 넘치며 새로운 사람을 만나는 것을 좋아하고, 사람에 대한 정이 많습니다. 위기 대처능력이 뛰어나 계획하기보다는 그때그때 일을 처리하는 편입니다. 상상력이 풍부하고 감성적이며 공감 능력 또한 뛰어납니다."
    },
    "ENFJ":{
        "clubs":[
            "전대극회",
            "YMCA",
            "청불",
            "유스호스텔",
            "청사",
            "선율",
            "소리터관현악단",
            "CCC",
            "JDM",
            "전대 토스트 마스터즈",
            "KUSA",
            "뉴에라",
            "하이코드",
            "가톨릭학생회"
        ],
        "type":"언변능숙형",
        "explanation1":"ENFJ는 타인의 성장을 도모하고 협동하는 타입입니다.",
        "explanation2":"직관적으로 사람을 파악하는 데 능하고, 눈치가 빠른 편입니다. 공감 능력이 뛰어나며 연민과 동정, 이해심이 많습니다. 이들은 타인의 관심사에 귀 기울이며 그들을 배려하고, 도움을 주기 위해 적극적으로 나서는 모습을 보입니다. 또한 군중을 이끌 수 있는 능력이 있어 리더의 역할을 맡는 경우도 있습니다."
    },
    "ENTP":{
        "clubs":[
            "메이플",
            "숨",
            "로터스"
        ],
        "type":"발명가형",
        "explanation1":"ENTP는 풍부한 상상력으로 새로운 것에 도전하는 것을 즐기는 타입입니다.",
        "explanation2":"외향형이지만 혼자만의 시간도 많이 필요로 하고, 대부분 즉흥적이고 유연한 성격으로 순발력이 뛰어나고 자유를 추구합니다. 다재다능하며 토론가적 기질이 강하고, 새로운 시도를 좋아합니다."
    },
    "ENTJ":{
        "clubs":[
            "기백",
            "전검회",
            "LIT:CH",
            "We'z",
            "DSM"
        ],
        "type":"지도자형",
        "explanation1":"ENTJ는 비전을 가지고 타인을 활력적으로 인도하는 타입입니다.",
        "explanation2":"이들은 크고 작은 도전을 좋아하며 충분한 시간과 자원이 제시되면 어떤 목표도 달성할 것이라고 굳게 믿습니다. 또한 자신의 아이디어와 비전을 제시하여 타인을 이끄는 모습을 보이기도 합니다. 문제에 논리적이고 객관적으로 접근하며, 전략적인 차원에서 해결 방안을 찾습니다. 계획적이고 체계적이며 행동 지향적입니다."
    }
}
